In [1]:
 ##PANDAS
    #manipulating and analysing data

In [2]:
import pandas as pd

# Series

In [3]:
city1 = pd.Series([12, -6, 8, -3])

In [4]:
city1

0    12
1    -6
2     8
3    -3
dtype: int64

In [5]:
city1.values

array([12, -6,  8, -3], dtype=int64)

In [6]:
city1.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
city1.dtype

dtype('int64')

In [8]:
city2 = pd.Series([12,-6,8,-3], index = ['day1', 'day2', 'day3','day4'])
city2

day1    12
day2    -6
day3     8
day4    -3
dtype: int64

In [9]:
city2['day3']

8

In [10]:
city2[['day1','day2','day3']]

day1    12
day2    -6
day3     8
dtype: int64

In [11]:
city2 > 0

day1     True
day2    False
day3     True
day4    False
dtype: bool

In [12]:
city2[city2>0]

day1    12
day3     8
dtype: int64

In [13]:
city2.min()

-6

In [14]:
city2.max()

12

In [15]:
city2[(city2>2)&(city2<9)]

day3    8
dtype: int64

In [16]:
city2 + 3

day1    15
day2    -3
day3    11
day4     0
dtype: int64

In [17]:
city2 - 3

day1    9
day2   -9
day3    5
day4   -6
dtype: int64

In [18]:
data = {'kerala':28, 'tamilnadu': 32, 'andra':34, 'delhi' : 36, 'bang' : 35}
data

{'kerala': 28, 'tamilnadu': 32, 'andra': 34, 'delhi': 36, 'bang': 35}

In [19]:
pd.Series(data)

kerala       28
tamilnadu    32
andra        34
delhi        36
bang         35
dtype: int64

In [20]:
data = pd.Series(data)
data

kerala       28
tamilnadu    32
andra        34
delhi        36
bang         35
dtype: int64

In [21]:
states = ['kerala', 'andra','delhi', 'tamilnadu','bang', 'bhopal']

In [22]:
city3 = pd.Series(data, index = states)

In [23]:
city3

kerala       28.0
andra        34.0
delhi        36.0
tamilnadu    32.0
bang         35.0
bhopal        NaN
dtype: float64

In [24]:
city3.isna() #null == true

kerala       False
andra        False
delhi        False
tamilnadu    False
bang         False
bhopal        True
dtype: bool

In [25]:
city3[city3.isna()]

bhopal   NaN
dtype: float64

In [26]:
city3.notna() #false for no values ,opposite isna->notna

kerala        True
andra         True
delhi         True
tamilnadu     True
bang          True
bhopal       False
dtype: bool

In [27]:
city3[city3.notna()]

kerala       28.0
andra        34.0
delhi        36.0
tamilnadu    32.0
bang         35.0
dtype: float64

# more on pandas

# DATA FRAMES

In [28]:
data = {'year':[2001,2002,2003,2004,2005],
        'states':['kerala', 'tn', 'karnataka', 'ap','telugana'],
       'pop': [300,455,336,560,246]}

In [29]:
data

{'year': [2001, 2002, 2003, 2004, 2005],
 'states': ['kerala', 'tn', 'karnataka', 'ap', 'telugana'],
 'pop': [300, 455, 336, 560, 246]}

In [30]:
pop_data = pd.DataFrame(data)
pop_data

   year     states  pop
0  2001     kerala  300
1  2002         tn  455
2  2003  karnataka  336
3  2004         ap  560
4  2005   telugana  246

In [31]:
pop_data1 = pd.DataFrame(data,columns = ['year','states', 'pop','income'])
pop_data1

   year     states  pop income
0  2001     kerala  300    NaN
1  2002         tn  455    NaN
2  2003  karnataka  336    NaN
3  2004         ap  560    NaN
4  2005   telugana  246    NaN

In [32]:
pop_data1['pop']

0    300
1    455
2    336
3    560
4    246
Name: pop, dtype: int64

In [33]:
pop_data1['income'] = [2300,3200,3300,34000,50000]
pop_data1

   year     states  pop  income
0  2001     kerala  300    2300
1  2002         tn  455    3200
2  2003  karnataka  336    3300
3  2004         ap  560   34000
4  2005   telugana  246   50000

In [34]:
pop_data1['debt'] = [3200,430,500,300,43]
pop_data1

   year     states  pop  income  debt
0  2001     kerala  300    2300  3200
1  2002         tn  455    3200   430
2  2003  karnataka  336    3300   500
3  2004         ap  560   34000   300
4  2005   telugana  246   50000    43

In [35]:
pop_data1['savings'] = pop_data1['income'] - pop_data1['debt']
pop_data1

   year     states  pop  income  debt  savings
0  2001     kerala  300    2300  3200     -900
1  2002         tn  455    3200   430     2770
2  2003  karnataka  336    3300   500     2800
3  2004         ap  560   34000   300    33700
4  2005   telugana  246   50000    43    49957

In [36]:
del pop_data1['year']

In [37]:
pop_data1

      states  pop  income  debt  savings
0     kerala  300    2300  3200     -900
1         tn  455    3200   430     2770
2  karnataka  336    3300   500     2800
3         ap  560   34000   300    33700
4   telugana  246   50000    43    49957

In [39]:
pop_data1['depth'] = 600
pop_data1

      states  pop  income  debt  savings  depth
0     kerala  300    2300  3200     -900    600
1         tn  455    3200   430     2770    600
2  karnataka  336    3300   500     2800    600
3         ap  560   34000   300    33700    600
4   telugana  246   50000    43    49957    600

In [40]:
pop_data1.drop('depth') # default check y axis which is 0
#we have to make axis = 1 which is x is 1
pop_data1

KeyError: "['depth'] not found in axis"

In [43]:
pop_data1.drop('depth' ,axis = 1)

      states  pop  income  debt  savings
0     kerala  300    2300  3200     -900
1         tn  455    3200   430     2770
2  karnataka  336    3300   500     2800
3         ap  560   34000   300    33700
4   telugana  246   50000    43    49957

In [45]:
pop_data1 = pop_data1.drop('depth' ,axis = 1)

In [46]:
pop_data1

      states  pop  income  debt  savings
0     kerala  300    2300  3200     -900
1         tn  455    3200   430     2770
2  karnataka  336    3300   500     2800
3         ap  560   34000   300    33700
4   telugana  246   50000    43    49957

In [47]:
pop_data1.ndim

2

In [48]:
pop_data1.size

25

In [49]:
len(pop_data1)

5

In [51]:
auto_data = pd.read_csv('auto-mpg.csv')

In [52]:
auto_data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10